library(readxl)
library(tidyverse)
data_git <- read_excel("data_git.xlsx", sheet = "data")


# Проведемо аналіз потужності для різних видів аналізу
#t-test, визначимо який ефект забезпечують надані вибірки

# Порвіняння оцінок по проедмету по всіх видах оціновання
library(pwr)
pwr.t2n.test(n1=288, n2=297 , sig.level=0.05, power=0.80)
# d = 0.2320735 вказує на можливість визначення малих ефектів, можна знехтувати нормальністю

# парні порівняння окремих видів оцінювання
pwr.t2n.test(n1=96, n2=99 , sig.level=0.05, power=0.80)
# d = 0.2320735 вказує на можливість визначення середніх ефектів, не можна знехтувати нормальністю

# для однофакторного дисперсійного аналізу по видах оцінювання
pwr.anova.test(k=3, n=195, sig.level=0.05, power=0.80)
# f = 0.1286633 вказує на можливість визначення малих ефектів, можна знехтувати нормальністю

# для двохфакторного дисперсійного аналізу зі змішаними ефектами
pwr.anova.test(k=6, n=99, sig.level=0.05, power=0.80)
# f = 0.1476496 вказує на можливість визначення малих ефектів, можна знехтувати нормальністю
